app/Models/AccountsModel.php

SELECT *
FROM `tbldepartmentcategory`
SELECT `tblaccounts`.*, `tbldepartment`.*, `tbldepartmentcategory`.*
FROM `tblaccounts`
LEFT JOIN `tbldepartment` ON `tblaccounts`.`department_id` = `tbldepartment`.`department_id`
LEFT JOIN `tbldepartmentcategory` ON `tbldepartment`.`department_category_id` = `tbldepartmentcategory`.`department_category_id`
WHERE `tblaccounts`.`status` = 2
---
    public function analyticsData()
    {
        $builder = $this->builder();
        $builder->select('tblaccounts.*, tbldepartment.*, tbldepartmentcategory.*, tblemployeetype.*');
        $builder->join('tbldepartment', 'tblaccounts.department_id = tbldepartment.department_id', 'left');
        $builder->join('tbldepartmentcategory', 'tbldepartment.department_category_id = tbldepartmentcategory.department_category_id', 'left');
        $builder->join('tblemployeetype', 'tblaccounts.employee_type_id = tblemployeetype.employee_type_id', 'left');
        $builder->where('tblaccounts.status', 2);
        $users = $builder->get()->getResultArray();